In [2]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:

titles.isnull().sum()

title    0
year     0
dtype: int64

### How many movies are listed in the titles dataframe?

In [9]:
len(titles["title"])

244914

### What are the earliest two films listed in the titles dataframe?

In [11]:
df=titles["title"].head(2)
df

0    Tasveer Mere Sanam
1              Only You
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [14]:
len(titles[titles["title"]=="Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [15]:
len(titles[titles["title"]=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [24]:
sorted(titles['year'][titles['title']=='Hamlet'])[0]

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [26]:
sorted(titles['year'][titles['title']=='Treasure Island'])

[1918, 1920, 1934, 1950, 1972, 1973, 1985, 1999]

### How many movies were made in the year 1950?

In [30]:
len(titles[titles['year']==1950])

1113

### How many movies were made in the year 1960?

In [31]:
len(titles[titles['year']==1960])

1549

### How many movies were made from 1950 through 1959?

In [83]:
len(titles['year'][(titles["year"]>=1950) & (titles["year"]<1960)])

12934

### In what years has a movie titled "Batman" been released?

In [36]:
titles['year'][titles["title"]=="Batman"]

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [3]:
cast=pd.read_csv("cast.csv")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [14]:
len(cast["character"][cast['title']=='Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [3]:
len(cast[["character"]][(cast['title']=='Inception')&(cast["n"].isna())])

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [5]:
len(cast[["character",'n']][(cast['title']=='Inception') &(cast["n"].notna())])

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [3]:
df=cast[["character","n"]][(cast['title']=='North by Northwest')&(cast['n'].notna())]
df.sort_values("n")

                           character     n
871426            Roger O. Thornhill   1.0
3518333                  Eve Kendall   2.0
1457165              Phillip Vandamm   3.0
3157232              Clara Thornhill   4.0
356707                 The Professor   5.0
3048272                Mrs. Townsend   6.0
1695173              Lester Townsend   7.0
1275337                      Leonard   8.0
2447081                     Valerian   9.0
1811387              Victor Larrabee  10.0
665768                         Licht  11.0
2295714                   Auctioneer  12.0
464736                     Dr. Cross  13.0
1508344               Sergeant Flamm  14.0
206471                Captain Junket  15.0
1384780  Charley - Chicago Policeman  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [24]:
df=cast[["name","n"]][(cast["year"]==1972)  &  (cast["title"]=="Sleuth") ]

In [22]:
df.sort_values("n")

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [25]:
df=cast[["name","n"]][(cast["year"]==2007)  &  (cast["title"]=="Sleuth") ]

In [26]:
df.sort_values("n")

                        name    n
326774         Michael Caine  1.0
1293634             Jude Law  2.0
1805907        Harold Pinter  3.0
260242       Kenneth Branagh  NaN
373877   Alec (II) Cawthorne  NaN
2724552    Eve (II) Channing  NaN
3370424    Carmel O'Sullivan  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
cast["character"][(cast["year"]==1921) & (cast["title"]=="Hamlet")]

7789            Fortinbras,
458904         K?nig Hamlet
555034              Laertes
1135279            Polonius
2185558             Horatio
2375993            Claudius
2664423    K?nigin Gertrude
3062023             Ophelia
3355176              Hamlet
Name: character, dtype: object

### How many roles were credited in Branagh’s 1996 Hamlet?

In [35]:
len(cast["character"][(cast["year"]==1996) & (cast["title"]=="Hamlet")])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [7]:
len(cast["character"][cast["character"]=="Hamlet"])

96

### How many people have played an "Ophelia"?

In [14]:
b=cast[["character","name"]][cast["character"]=="Ophelia"]
print("people played Ophelia role",len(b["name"].value_counts()))

people played Ophelia role 115

### How many people have played a role called "The Dude"?

In [11]:
b=cast[["character","name"]][cast["character"]=="The Dude"]
print("people played the dude role",len(b["name"].value_counts()))

people played the dude role 19

### How many people have played a role called "The Stranger"?

In [54]:
b=cast[["character","name"]][cast["character"]=="The Stranger"]
print("people played The Stranger role",len(b["name"].value_counts()))

people played The Stranger role 202

### How many roles has Sidney Poitier played throughout his career?

In [55]:
df=cast["character"][cast["name"]=="Sidney Poitier"]
print("roles played",len(df.value_counts()))

roles played 41

### How many roles has Judi Dench played?

In [15]:
df=cast["character"][cast["name"]=="Judi Dench"]
print("roles played",len(df.value_counts()))

roles played 46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [61]:
df=cast[["character","year"]][(cast["name"]=="Cary Grant") & (cast["year"]>=1940 ) &(cast["year"]<1950) & (cast["n"]==2)]

In [62]:
df.sort_values("year")

          character  year
871423   Nick Arden  1940
871433  Roger Adams  1941

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [16]:
df=cast[["character","year"]][(cast["name"]=="Cary Grant") & (cast["year"]>=1940 ) &(cast["year"]<1950) & (cast["n"]==1)]

In [17]:
df.sort_values("year")

                                   character  year
871448                           Matt Howard  1940
871407                          Walter Burns  1940
871450                    C. K. Dexter Haven  1940
871438                      Johnnie Aysgarth  1941
871452                          Leopold Dilg  1942
871429                 Patrick 'Pat' O'Toole  1942
871398                         Capt. Cassidy  1943
871422  Joe Adams -posing as Joe Bascopolous  1943
871430                           Jerry Flynn  1944
871390                     Mortimer Brewster  1944
871425                            Ernie Mott  1944
871424                           Cole Porter  1946
871427                                Devlin  1946
871444                           Dick Nugent  1947
871445                                Dudley  1947
871421                         Jim Blandings  1948
871402                     Dr. Madison Brown  1948
871411                 Captain Henri Rochard  1949

### How many roles were available for actors in the 1950s?

In [5]:
df=cast[["type"]][(cast["year"]>=1950)&  (cast["year"]<1960)]
df["type"].value_counts()[0]

157738

### How many roles were available for actresses in the 1950s?

In [6]:
df=cast[["type"]][(cast["year"]>=1950)&  (cast["year"]<1960)]
df["type"].value_counts()[1]

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [79]:
len(cast["character"][(cast["year"]>=cast["year"].min()) &(cast["year"]<=1980)& (cast["n"]==1)] )

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [80]:
len(cast["character"][(cast["year"]>=cast["year"].min()) &(cast["year"]<=1980)& (cast["n"]!=1)] )

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [81]:
len(cast["character"][(cast['year']==1980) &(cast["n"].isna())])

4466